<?xml version="1.0" encoding="UTF-8"?>
<plist version="1.0">
    <dict>
        <key>Comment</key>
        <string>Joel you should really use github.</string>
        <key>Description</key>
        <string>Downloads the latest version of DEPNotify and creates a package.</string>
        <key>Identifier</key>
        <string>om.github.matinsa.pkg.DEPNotify</string>
        <key>Input</key>
        <dict>
            <key>BUNDLE_ID</key>
            <string>menu.nomad.DEPNotify</string>
            <key>NAME</key>
            <string>DEPNotify</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>om.github.matinsa.download.DEPNotify</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_request</key>
                    <dict>
                        <key>chown</key>
                        <array>
                            <dict>
                                <key>group</key>
                                <string>admin</string>
                                <key>path</key>
                                <string>Applications/Utilities</string>
                                <key>user</key>
                                <string>root</string>
                            </dict>
                        </array>
                        <key>id</key>
                        <string>%BUNDLE_ID%</string>
                        <key>options</key>
                        <string>purge_ds_store</string>
                        <key>pkgname</key>
                        <string>%NAME%-%version%</string>
                        <key>pkgroot</key>
                        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                        <key>version</key>
                        <string>%version%</string>
                    </dict>
                </dict>
                <key>Processor</key>
                <string>PkgCreator</string>
            </dict>
        </array>
    </dict>
</plist>
